In [29]:
# DATA
import pandas as pd

df = pd.DataFrame(
    data={
        'ID': [1, 2, 3, 4, 5, 6, 7, 8],
        'NAME': ['ADAM', 'PAUL', 'JACK', 'JOHN', 'ADAM', 'JENNIFER', 'WANDA', 'JOHNY'],
        'SURNAME': ['SMITH', 'WAGNER', 'RYAN', 'WICK', 'WAYNE', 'NICK', 'RYAN', 'BRYAN'],
        'COUNTRY': ['USA', 'FRANCE', 'GERMANY', 'CANADA', 'USA', 'CANADA', 'USA', 'FRANCE'],
        'AGE': [25, 35, 32, 40, 21, 24, 36, 19],
        'SALARY': [150000, 250000, 200000, 300000, 225000, 200000, 150000, 100000]
    }
)
df

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
0   1      ADAM   SMITH      USA   25  150000
1   2      PAUL  WAGNER   FRANCE   35  250000
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
4   5      ADAM   WAYNE      USA   21  225000
5   6  JENNIFER    NICK   CANADA   24  200000
6   7     WANDA    RYAN      USA   36  150000
7   8     JOHNY   BRYAN   FRANCE   19  100000

In [30]:
# SINGLE CONDITION
# method 1: Dataframe way
df[df['ID'] > 5]

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000
7   8     JOHNY   BRYAN  FRANCE   19  100000

In [31]:
# SINGLE CONDITION
# method 2: query function
df.query('ID > 5')

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000
7   8     JOHNY   BRYAN  FRANCE   19  100000

In [32]:
# SINGLE CONDITION
# method 3: loc function
df.loc[df["ID"] > 5]

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000
7   8     JOHNY   BRYAN  FRANCE   19  100000

In [33]:
# SINGLE CONDITION (NOT)
# method 1: Dataframe way
df[~(df['ID'] > 5)]

   ID  NAME SURNAME  COUNTRY  AGE  SALARY
0   1  ADAM   SMITH      USA   25  150000
1   2  PAUL  WAGNER   FRANCE   35  250000
2   3  JACK    RYAN  GERMANY   32  200000
3   4  JOHN    WICK   CANADA   40  300000
4   5  ADAM   WAYNE      USA   21  225000

In [34]:
# SINGLE CONDITION (NOT)
# method 2: query function
df.query('~(ID > 5)')

   ID  NAME SURNAME  COUNTRY  AGE  SALARY
0   1  ADAM   SMITH      USA   25  150000
1   2  PAUL  WAGNER   FRANCE   35  250000
2   3  JACK    RYAN  GERMANY   32  200000
3   4  JOHN    WICK   CANADA   40  300000
4   5  ADAM   WAYNE      USA   21  225000

In [35]:
# MULTIPLE CONDITION (AND)
# method 1: Dataframe way
df[(df.ID > 5) & (df.COUNTRY == 'CANADA')]

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000

In [36]:
# MULTIPLE CONDITION (AND)
# method 2: query function
df.query('ID > 5 and COUNTRY == "CANADA"')

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000

In [37]:
# MULTIPLE CONDITION (AND & OR)
# method 1: Dataframe way
df[(df.ID > 5) & ((df.COUNTRY == 'CANADA') | (df.COUNTRY == 'USA'))]

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000

In [38]:
# MULTIPLE CONDITION (AND & OR)
# method 2: query function
df.query('ID > 5 and (COUNTRY == "CANADA" or COUNTRY == "USA")')

   ID      NAME SURNAME COUNTRY  AGE  SALARY
5   6  JENNIFER    NICK  CANADA   24  200000
6   7     WANDA    RYAN     USA   36  150000

In [39]:
# IN OPERATOR
# method 1: Dataframe way
df[df.COUNTRY.isin(['GERMANY','FRANCE'])]

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
1   2   PAUL  WAGNER   FRANCE   35  250000
2   3   JACK    RYAN  GERMANY   32  200000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [40]:
# IN OPERATOR
# method 2: query function
df.query('COUNTRY in ["GERMANY","FRANCE"]')

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
1   2   PAUL  WAGNER   FRANCE   35  250000
2   3   JACK    RYAN  GERMANY   32  200000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [41]:
df.query('COUNTRY.isin(["GERMANY", "FRANCE"]).values')

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
1   2   PAUL  WAGNER   FRANCE   35  250000
2   3   JACK    RYAN  GERMANY   32  200000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [42]:
# NOT IN OPERATOR
# method 1: Dataframe way
df[~df.COUNTRY.isin(['USA','FRANCE'])]

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
5   6  JENNIFER    NICK   CANADA   24  200000

In [43]:
# NOT IN OPERATOR
# method 2: query function
df.query('COUNTRY not in ["USA","FRANCE"]')

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
5   6  JENNIFER    NICK   CANADA   24  200000

In [44]:
df.query('~(COUNTRY in ["USA","FRANCE"])')

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
5   6  JENNIFER    NICK   CANADA   24  200000

In [45]:
# LIKE OPERATOR - startswith
# method 1: Dataframe way
df[df.SURNAME.str.startswith('WA')]

   ID  NAME SURNAME COUNTRY  AGE  SALARY
1   2  PAUL  WAGNER  FRANCE   35  250000
4   5  ADAM   WAYNE     USA   21  225000

In [46]:
# LIKE OPERATOR - startswith
# method 2: query function
df.query('SURNAME.str.startswith("WA")')

   ID  NAME SURNAME COUNTRY  AGE  SALARY
1   2  PAUL  WAGNER  FRANCE   35  250000
4   5  ADAM   WAYNE     USA   21  225000

In [47]:
# LIKE OPERATOR - endswith
# method 1: Dataframe way
df[df.SURNAME.str.endswith('YAN')]

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
2   3   JACK    RYAN  GERMANY   32  200000
6   7  WANDA    RYAN      USA   36  150000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [48]:
# LIKE OPERATOR - endswith
# method 2: query function
df.query('SURNAME.str.endswith("YAN").values')

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
2   3   JACK    RYAN  GERMANY   32  200000
6   7  WANDA    RYAN      USA   36  150000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [49]:
# LIKE OPERATOR - contains
# method 1: Dataframe way
df[df.NAME.str.contains('OH')]

   ID   NAME SURNAME COUNTRY  AGE  SALARY
3   4   JOHN    WICK  CANADA   40  300000
7   8  JOHNY   BRYAN  FRANCE   19  100000

In [50]:
# LIKE OPERATOR - contains
# method 2: query function
df.query('NAME.str.contains("OH")')

   ID   NAME SURNAME COUNTRY  AGE  SALARY
3   4   JOHN    WICK  CANADA   40  300000
7   8  JOHNY   BRYAN  FRANCE   19  100000

In [51]:
df

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
0   1      ADAM   SMITH      USA   25  150000
1   2      PAUL  WAGNER   FRANCE   35  250000
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK   CANADA   40  300000
4   5      ADAM   WAYNE      USA   21  225000
5   6  JENNIFER    NICK   CANADA   24  200000
6   7     WANDA    RYAN      USA   36  150000
7   8     JOHNY   BRYAN   FRANCE   19  100000

In [52]:
# Change USA to NaN

import numpy as np

df.loc[df.COUNTRY == "USA", 'COUNTRY'] = np.nan
df

   ID      NAME SURNAME  COUNTRY  AGE  SALARY
0   1      ADAM   SMITH      USA   25  150000
1   2      PAUL  WAGNER   FRANCE   35  250000
2   3      JACK    RYAN  GERMANY   32  200000
3   4      JOHN    WICK      NaN   40  300000
4   5      ADAM   WAYNE      USA   21  225000
5   6  JENNIFER    NICK      NaN   24  200000
6   7     WANDA    RYAN      USA   36  150000
7   8     JOHNY   BRYAN   FRANCE   19  100000

In [ ]:
# method 1: Dataframe way
df[df.COUNTRY.notna()]

In [53]:
# method 1: Dataframe way
df[df.COUNTRY.notnull()]

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
0   1   ADAM   SMITH      USA   25  150000
1   2   PAUL  WAGNER   FRANCE   35  250000
2   3   JACK    RYAN  GERMANY   32  200000
4   5   ADAM   WAYNE      USA   21  225000
6   7  WANDA    RYAN      USA   36  150000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [ ]:
# method 2: query function
df.query('COUNTRY.notna()')

In [59]:
# method 2: query function
df.query('COUNTRY.notnull()')

   ID   NAME SURNAME  COUNTRY  AGE  SALARY
0   1   ADAM   SMITH      USA   25  150000
1   2   PAUL  WAGNER   FRANCE   35  250000
2   3   JACK    RYAN  GERMANY   32  200000
4   5   ADAM   WAYNE      USA   21  225000
6   7  WANDA    RYAN      USA   36  150000
7   8  JOHNY   BRYAN   FRANCE   19  100000

In [ ]:
# method 1: Dataframe way
df[df.COUNTRY.isna()]

In [57]:
# method 1: Dataframe way
df[df.COUNTRY.isnull()]

   ID      NAME SURNAME COUNTRY  AGE  SALARY
3   4      JOHN    WICK     NaN   40  300000
5   6  JENNIFER    NICK     NaN   24  200000

In [ ]:
# method 2: query function
df.query('COUNTRY.isna()')

In [61]:
# method 2: query function
df.query('COUNTRY.isnull()')

   ID      NAME SURNAME COUNTRY  AGE  SALARY
3   4      JOHN    WICK     NaN   40  300000
5   6  JENNIFER    NICK     NaN   24  200000

In [62]:
df['MEMBER_DATE'] = [
    '2021-02-14','2005-03-17','2000-03-01','1999-01-19',
    '2011-04-24','2008-11-10','2015-11-30','2019-04-19'
]

df

   ID      NAME SURNAME  COUNTRY  AGE  SALARY MEMBER_DATE
0   1      ADAM   SMITH      USA   25  150000  2021-02-14
1   2      PAUL  WAGNER   FRANCE   35  250000  2005-03-17
2   3      JACK    RYAN  GERMANY   32  200000  2000-03-01
3   4      JOHN    WICK      NaN   40  300000  1999-01-19
4   5      ADAM   WAYNE      USA   21  225000  2011-04-24
5   6  JENNIFER    NICK      NaN   24  200000  2008-11-10
6   7     WANDA    RYAN      USA   36  150000  2015-11-30
7   8     JOHNY   BRYAN   FRANCE   19  100000  2019-04-19

In [63]:
# method 1: Dataframe way
df[df.MEMBER_DATE > '2015-01-01'] #Conditional

   ID   NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
0   1   ADAM   SMITH     USA   25  150000  2021-02-14
6   7  WANDA    RYAN     USA   36  150000  2015-11-30
7   8  JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [64]:
df.query("MEMBER_DATE > '2015-01-01'") #Querying

   ID   NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
0   1   ADAM   SMITH     USA   25  150000  2021-02-14
6   7  WANDA    RYAN     USA   36  150000  2015-11-30
7   8  JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [ ]:
df.MEMBER_DATE = pd.to_datetime(df.MEMBER_DATE)

In [70]:
# method 1: Dataframe way
df[df.MEMBER_DATE.dt.year < 2005]

   ID  NAME SURNAME  COUNTRY  AGE  SALARY MEMBER_DATE
2   3  JACK    RYAN  GERMANY   32  200000  2000-03-01
3   4  JOHN    WICK      NaN   40  300000  1999-01-19

In [69]:
# method 2: query function
df.query("MEMBER_DATE.dt.year < 2005")

   ID  NAME SURNAME  COUNTRY  AGE  SALARY MEMBER_DATE
2   3  JACK    RYAN  GERMANY   32  200000  2000-03-01
3   4  JOHN    WICK      NaN   40  300000  1999-01-19

In [72]:
# SELECT * FROM TABLE WHERE AGE * 2 < 50;
df.query("AGE * 2 < 50")

   ID      NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
4   5      ADAM   WAYNE     USA   21  225000  2011-04-24
5   6  JENNIFER    NICK     NaN   24  200000  2008-11-10
7   8     JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [75]:
df[(df.AGE * 2 < 50)]

   ID      NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
4   5      ADAM   WAYNE     USA   21  225000  2011-04-24
5   6  JENNIFER    NICK     NaN   24  200000  2008-11-10
7   8     JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [76]:
# SELECT * FROM TABLE WHERE NAME > 'JO';
df.query("NAME > 'JO'")

   ID   NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
1   2   PAUL  WAGNER  FRANCE   35  250000  2005-03-17
3   4   JOHN    WICK     NaN   40  300000  1999-01-19
6   7  WANDA    RYAN     USA   36  150000  2015-11-30
7   8  JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [84]:
df[(df.NAME > 'JO')]

   ID   NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
1   2   PAUL  WAGNER  FRANCE   35  250000  2005-03-17
3   4   JOHN    WICK     NaN   40  300000  1999-01-19
6   7  WANDA    RYAN     USA   36  150000  2015-11-30
7   8  JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [ ]:
df.query("AGE > 30", inplace=True)

In [87]:
# SELECT * FROM TABLE WHERE AGE * 2 > 30;

value = 30
df.query("AGE * 2 < @value")

   ID      NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
4   5      ADAM   WAYNE     USA   21  225000  2011-04-24
5   6  JENNIFER    NICK     NaN   24  200000  2008-11-10
7   8     JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [90]:
df[(df.AGE * 2 < value)]

   ID      NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE
4   5      ADAM   WAYNE     USA   21  225000  2011-04-24
5   6  JENNIFER    NICK     NaN   24  200000  2008-11-10
7   8     JOHNY   BRYAN  FRANCE   19  100000  2019-04-19

In [101]:
df['FULL NAME'] = df['NAME'] + ' ' + df["SURNAME"]

df.query("`FULL NAME` == 'PAUL WAGNER'")

   ID  NAME SURNAME COUNTRY  AGE  SALARY MEMBER_DATE    FULL NAME
1   2  PAUL  WAGNER  FRANCE   35  250000  1977-01-27  PAUL WAGNER

In [78]:
# SELECT ROWS
df[['NAME','AGE']]
df.loc[:,['NAME','AGE']]

       NAME  AGE
0      ADAM   25
1      PAUL   35
2      JACK   32
3      JOHN   40
4      ADAM   21
5  JENNIFER   24
6     WANDA   36
7     JOHNY   19

In [ ]:
df.loc[df['likes'] >= 1000000, ['video_id', 'title']]
df[df['likes'] >= 1000000][['video_id', 'title']]